*** Typescript
    #+BEGIN_SRC emacs-lisp
      (use-package tide
        :diminish tide-mode
        :diminish typescript-mode
        :ensure t
        :after company)

      (defun setup-tide-mode ()
        (interactive)
        (tide-setup)
        (flycheck-mode +1)
        (setq flycheck-check-syntax-automatically '(save mode-enabled idle-change))
        (eldoc-mode +1)
        (tide-hl-identifier-mode +1)
        ;; company is an optional dependency. You have to
        ;; install it separately via package-install
        ;; `M-x package-install [ret] company`
        (company-mode +1))

          
        (add-hook 'before-save-hook 'tide-format-before-save)

        (add-hook 'typescript-mode-hook #'setup-tide-mode)

      (add-hook 'typescript-mode-hook
                (lambda ()
                  (local-set-key (kbd "C-c f") 'tide-fix)))
    #+END_SRC

    #+RESULTS:
    | (lambda nil (local-set-key (kbd C-c f) (quote tide-fix))) | (lambda nil (local-set-key (kbd C-c f) (tide-fix))) | (lambda nil (local-set-key (C-c f) (tide-fix))) | setup-tide-mode | yas-minor-mode |

